LEXICON = {
    'start': '''Привет, <b>{0}</b>! 🤖 Добро пожаловать в <b>Neural Search</b> - твоего надежного помощника в поиске и выборе нейросетей! 🚀

Я здесь, чтобы помочь тебе найти идеальную нейросеть для твоего проекта. Просто расскажи свои задачи или сферу применения, и я подберу для тебя оптимальные варианты. 🌐

Погнали в мир нейронных сетей! 🚀🤖''',
    'no_echo': 'Я не могу ответить на это сообщение, для перезапуска бота'
               ' напишите /start',
    'about_process': '''Привет! 🤖✨

Спасибо, что выбрали нашего бота по поиску нейросетей! 🚀

🔍 Что умеет наш бот?
Мы помогаем вам найти подходящую нейросеть для вашей задачи. Просто укажите параметры, и мы предоставим вам лучшие варианты.

🕵️ Как взаимодействовать:

Есть 2 варианта поиска подходящих нейросетей:
1) Фильтры:
Все что нужно - это просто выбрать те параметры, которым должен соответствовать бот. Эти параметры могу касаться как сферы применения, так и конкретных задач, которые бот должен уметь выполнять.
Программа найдет тех ботов, которые соответствуют ВСЕМ выбранным параметрам.

2) Система поиска:
Вам просто нужно написать, что вы хотите сделать, согласно примеру, а дальше программа сделает все за вас.

🤝 Контакты:
Если у вас есть вопросы или предложения, не стесняйтесь обращаться! Мы всегда готовы помочь.

📧 Электронная почта: support@example.com
💬 Чат поддержки: t.me/example

Спасибо за использование нашего бота! 🌟 ''',
    'filter_button': '👀Фильтры',
    'search_button': '🔎Поиск',
    'pay_money': 'Пока всё сука',
    'about_button': 'Подробнее о боте',
    'search_process': 'Напиши, что нужно сделать и я постараюсь тебе помочь!\n\n <i>Пример: "Создать картинку для аватарки"</i>\n\n⚠️Эта функция может работать некорректно.',
    'filter_process': 'Как это работает❓\n\nПросто зайди в нужную категорию, выбери те параметры, которые тебе нужны, потом перейди обратно сюда, нажав на кнопку <b>\"Вернуться назад\"</b>, и жми кнопку <b>\"Найти\"!</b>\n\n👇А здесь выбранные тобой фильтры{0}',
    'clear_button': 'Очистить фильтры🗑',
    'find_button': 'Найти🔥',
    'app_scope_button': '🌐Сферы применения',
    'converting_button': '🔄Преобразование',
    'tasks_button':  '🎯Задачи',
    'nothing_found': 'К сожалению, по вашему запросу ничего не нашлось, попробуйте нажать кнопку <b>\"Очистить фильтры\"</b> и сделать выбор заново.\nПомните, ищутся только те нейросети, которые содержать ВСЕ указанные вами фильтры.',
    'nothing_picked_message': 'Вы не выбрали ни одного фильтра!',
    'picked_filters_message': '\n...Пока пусто...🙃',
    'show_more_responses': '🤖<b>{0}</b>🤖\n\n <b>Описание:</b>\n{1}\n\n{2}',
    'find_button_pressed': '🤖<b>{0}</b>🤖\n\n<b>Сферы применения:</b> {1}\n<b>Преобразование:</b> {2}\n<b>Задачи:</b> {3}\n\nСсылка там👇',
    'before_find_button': 'По вашему запросу всего найдено нейросетей: {0}',
    'app_scope_process': '<b>Сферы применения</b> 🌐 - это области, в которых нейросети находят свое применение. Это может быть медицина, финансы, образование и так далее.\n Укажи мне свою область, и я предложу нейросети, наилучшим образом подходящие для твоих задач!\n\n💡<i>Можно выбрать несколько вариантов</i>',
    'converting_process': '<b>Преобразование</b> 🔄 - это способность нейросети изменять входные данные, превращая их в более полезный формат. Например, это может быть перевод текста, изменение изображения или другие формы обработки данных.\nУточни, какие преобразования тебе нужны, и я найду подходящие нейросети!\n\n💡<i>Можно выбрать несколько вариантов</i>',
    'tasks_process': '<b>Задачи</b> 🎯 - это конкретные цели, которые нейросеть может выполнять. Это может включать в себя классификацию изображений, распознавание речи, генерацию текста и многое другое.\n Расскажи мне, какую задачу ты хочешь решить, и я подскажу подходящие нейросети!\n\n💡<i>Можно выбрать несколько вариантов</i>'

}

LEXICON_COMMANDS = {
    '/start': 'Перезапуск бота',
}
